# cask before all
brew "caskroom/cask/brew-cask"

# get xquartz, it is a dependency
cask "xquartz"

# brew away
brew "dockutil"
brew "dos2unix"
brew "editorconfig"
brew "fasd"
brew "ffmpeg"
brew "gcc"
brew "gdal"
brew "git"
brew "go"
brew "hub"
brew "jmeter"
brew "jq"
brew "macvim", args: ["custom-icons", "override-system-vim"]
brew "mdbtools"
brew "nvm"
brew "pv"
brew "pxz"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-which-ext"
brew "readline"
brew "sqlite"
brew "terminal-notifier"
brew "the_platinum_searcher"
brew "tmux"
brew "unrar"
brew "wget"
brew "wine"
brew "youtube-dl"
brew "zopfli"
brew "zsh"
brew "zsh-lovers"

# emacs-mac
tap "railwaycat/emacsmacport"
brew "emacs-mac", args: ["with-spacemacs-icon"]

# casks
cask "adobe-photoshop-lightroom"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "iterm2"
cask "julia"
cask "loading"
cask "microsoft-office"
cask "packer"
cask "r"
cask "rstudio"
cask "sequel-pro"
cask "skype"
cask "spectacle"
cask "transmission"
cask "vagrant"
cask "virtualbox"
cask "vlc"
cask "xmind"

# fonts
tap "caskroom/fonts"
cask "font-lato"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
