# cask before all
brew "caskroom/cask/brew-cask"

# brew away
brew "dos2unix"
brew "editorconfig"
brew "ffmpeg"
brew "gdal"
brew "git"
brew "go"
brew "hdf5"
brew "hub"
brew "jmeter"
brew "jq"
brew "macvim"
brew "mdbtools"
brew "nvm"
brew "pv"
brew "pxz"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-which-ext"
brew "readline"
brew "sqlite"
brew "the_platinum_searcher"
brew "tmux"
brew "unrar"
brew "wget"
brew "wine"
brew "youtube-dl"
brew "zopfli"
brew "zsh"
brew "zsh-lovers"

# casks
cask "google-chrome"
